Importar librerias

In [43]:
import pandas as pd

Abrir archivo csv

In [44]:
data = pd.read_csv('/Users/nandoramirez/Downloads/MoneyControl_2025-08-29_Trabajado.csv')

Inspección inicial data

In [45]:
data.head()

,FECHA,TIPO,CANTIDAD,CATEGORÍA,CUENTA,NOTA,CANTIDAD_2
0,31/07/18,Transferencia,"1.095.997,00",NaN,Ingreso de efectivo,Pago doble Citibank,"1.095.997,00"
1,1/08/18,Gastos,"-15.000,00",Uber,Efectivo,EBAG,"15.000,00"
2,1/08/18,Gastos,"-10.000,00",Celular,Efectivo,Recarga Nando,"10.000,00"
3,1/08/18,Gastos,"-211.000,00",Compra Saldo Conexión +,Efectivo,NaN,"211.000,00"
4,1/08/18,Ingresos,"20.006,09",Venta Recargas,Cuenta bancaria,Recarga Juan Laneros,"20.006,09"

Ver tipo de variables del dataframte

In [46]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12131 entries, 0 to 12130
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   FECHA       12131 non-null  object
 1   TIPO        12131 non-null  object
 2   CANTIDAD    12131 non-null  object
 3   CATEGORÍA   10413 non-null  object
 4   CUENTA      12131 non-null  object
 5   NOTA        8847 non-null   object
 6   CANTIDAD_2  12131 non-null  object
dtypes: object(7)
memory usage: 663.5+ KB

Consultar últimos registros dataframe

In [106]:
data.head()

,FECHA,TIPO,CANTIDAD,CATEGORÍA,CUENTA,NOTA,CANTIDAD_2
0,31/07/18,Transferencia,"1.095.997,00",NaN,Ingreso de efectivo,Pago doble Citibank,"1.095.997,00"
1,1/08/18,Gastos,"-15.000,00",Uber,Efectivo,EBAG,"15.000,00"
2,1/08/18,Gastos,"-10.000,00",Celular,Efectivo,Recarga Nando,"10.000,00"
3,1/08/18,Gastos,"-211.000,00",Compra Saldo Conexión +,Efectivo,NaN,"211.000,00"
4,1/08/18,Ingresos,"20.006,09",Venta Recargas,Cuenta bancaria,Recarga Juan Laneros,"20.006,09"

Comprobar duplicados

In [107]:
data.nunique()

FECHA         2327
TIPO             3
CANTIDAD      3104
CATEGORÍA       84
CUENTA          83
NOTA          3737
CANTIDAD_2    2781
dtype: int64

Cálculo de valores faltantes

In [108]:
data.isnull().sum()

FECHA            0
TIPO             0
CANTIDAD         0
CATEGORÍA     1718
CUENTA           0
NOTA          3284
CANTIDAD_2       0
dtype: int64

Calcular el porcentaje de valores faltantes en cada columna

In [109]:
(data.isnull().sum()/(len(data)))*100

FECHA          0.000000
TIPO           0.000000
CANTIDAD       0.000000
CATEGORÍA     14.162064
CUENTA         0.000000
NOTA          27.071140
CANTIDAD_2     0.000000
dtype: float64

Conocer los valores faltantes de la columna Categoria

In [110]:
print(data.CATEGORÍA.isnull())

0         True
1        False
2        False
3        False
4        False
         ...
12126    False
12127    False
12128    False
12129    False
12130    False
Name: CATEGORÍA, Length: 12131, dtype: bool